dylandelaporte/contiki/arch/cpu/cc26x0-cc13x0/rf-core/prop-mode.c
#ifdef PROP_MODE_CONF_SETTINGS
#define PROP_MODE_SETTINGS PROP_MODE_CONF_SETTINGS
#elif RF_TX_POWER_TABLE_STYLE == RF_TX_POWER_TABLE_SIMPLELINK
#define PROP_MODE_SETTINGS PROP_MODE_SETTINGS_SIMPLELINK
#else
#define PROP_MODE_SETTINGS PROP_MODE_SETTINGS_SMARTRF
#endif

#if PROP_MODE_SETTINGS == PROP_MODE_SETTINGS_SIMPLELINK
#include "prop-settings.h"

#define settings_prop_mode          rf_prop_mode
#define settings_cmd_prop_fs        rf_cmd_prop_fs
#define settings_cmd_prop_tx_adv    rf_cmd_prop_tx_adv
#define settings_cmd_prop_rx_adv    rf_cmd_prop_rx_adv
#define settings_cmd_prop_radio_div_setup   rf_cmd_prop_radio_div_setup

#elif PROP_MODE_SETTINGS == PROP_MODE_SETTINGS_SMARTRF
#include "smartrf-settings.h"

#define settings_prop_mode          smartrf_settings_prop_mode
#define settings_cmd_prop_fs        smartrf_settings_cmd_fs
#define settings_cmd_prop_tx_adv    smartrf_settings_cmd_prop_tx_adv
#define settings_cmd_prop_rx_adv    smartrf_settings_cmd_prop_rx_adv
#define settings_cmd_prop_radio_div_setup   smartrf_settings_cmd_prop_radio_div_setup

#else
#error "uncknown RFsettings style"
#endif



#ifndef CC_ACCESS_NOW

/** \def CC_ACCESS_NOW(x)
 * This macro ensures that the access to a non-volatile variable can
 * not be reordered or optimized by the compiler.
 * See also https://lwn.net/Articles/508991/ - In Linux the macro is
 * called ACCESS_ONCE
 * The type must be passed, because the typeof-operator is a gcc
 * extension
 */

#define CC_ACCESS_NOW(type, variable) (*(volatile type *)&(variable))
#endif

/* Convenience macros for volatile access with the RF commands */
#define v_cmd_radio_setup   CC_ACCESS_NOW(rfc_CMD_PROP_RADIO_DIV_SETUP_t, settings_cmd_prop_radio_div_setup)
#define v_cmd_fs            CC_ACCESS_NOW(rfc_CMD_FS_t,                   settings_cmd_prop_fs)
#define v_cmd_tx            CC_ACCESS_NOW(rfc_CMD_PROP_TX_ADV_t,          settings_cmd_prop_tx_adv)
#define v_cmd_rx            CC_ACCESS_NOW(rfc_CMD_PROP_RX_ADV_t,          settings_cmd_prop_rx_adv)

/*---------------------------------------------------------------------------*/
/* Select power table based on the frequency band */
#ifdef TX_POWER_CONF_PROP_DRIVER
#define TX_POWER_DRIVER TX_POWER_CONF_PROP_DRIVER
#elif RF_TX_POWER_TABLE_STYLE == RF_TX_POWER_TABLE_SIMPLELINK

#include "rf/tx-power.h"
#define TX_POWER_DRIVER   rf_tx_power_table

#elif (DOT_15_4G_FREQUENCY_BAND_ID==DOT_15_4G_FREQUENCY_BAND_470) \
    ||(DOT_15_4G_FREQUENCY_BAND_ID==DOT_15_4G_FREQUENCY_BAND_431)

#define TX_POWER_DRIVER PROP_MODE_TX_POWER_431_527
#elif DOT_15_4G_FREQUENCY_BAND_ID==DOT_15_4G_FREQUENCY_BAND_780
#define TX_POWER_DRIVER PROP_MODE_TX_POWER_779_930
#else
#pragma warning ( "uncknown DOT_15_4G_FREQUENCY_BAND - use default 780MHz band power table. Declare valid TX_POWER_CONF_PROP_DRIVER" )
#define TX_POWER_DRIVER PROP_MODE_TX_POWER_779_930

#endif
/*---------------------------------------------------------------------------*/
#if RF_TX_POWER_TABLE_STYLE != RF_TX_POWER_TABLE_SIMPLELINK
#include "tx-power.h"
extern const prop_mode_tx_power_config_t TX_POWER_DRIVER[];

/* Default TX Power - position in output_power[] */
const prop_mode_tx_power_config_t *tx_power_current = (&TX_POWER_DRIVER[1]);

#else
const prop_mode_tx_power_config_t *tx_power_current = NULL;
#endif

/* Max and Min Output Power in dBm */
#define OUTPUT_POWER_MAX     (rfc_tx_power_max(TX_POWER_DRIVER))
#define OUTPUT_POWER_MIN     (rfc_tx_power_min(TX_POWER_DRIVER))

/*---------------------------------------------------------------------------*/
#ifdef PROP_MODE_CONF_LO_DIVIDER
#define PROP_MODE_LO_DIVIDER   PROP_MODE_CONF_LO_DIVIDER
#else
#define PROP_MODE_LO_DIVIDER   0x05
#endif
/*---------------------------------------------------------------------------*/
#ifdef PROP_MODE_CONF_RX_BUF_CNT
#define PROP_MODE_RX_BUF_CNT PROP_MODE_CONF_RX_BUF_CNT
#else
#define PROP_MODE_RX_BUF_CNT 4
#endif
/*---------------------------------------------------------------------------*/
#define DATA_ENTRY_LENSZ_NONE 0
#define DATA_ENTRY_LENSZ_BYTE 1
#define DATA_ENTRY_LENSZ_WORD 2 /* 2 bytes */

/* The size of the metadata (excluding the packet length field) */
#define RX_BUF_METADATA_SIZE \
  (CRC_LEN * RF_CORE_RX_BUF_INCLUDE_CRC \
      + RF_CORE_RX_BUF_INCLUDE_RSSI \
      + RF_CORE_RX_BUF_INCLUDE_CORR \
      + 4 * RF_CORE_RX_BUF_INCLUDE_TIMESTAMP)

/* The offset of the packet length in a rx buffer */
#define RX_BUF_LENGTH_OFFSET sizeof(rfc_dataEntry_t)
/* The offset of the packet data in a rx buffer */
#define RX_BUF_DATA_OFFSET (RX_BUF_LENGTH_OFFSET + DOT_4G_PHR_LEN)

#define ALIGN_TO_4(size)	(((size) + 3) & ~3)

#define RX_BUF_SIZE ALIGN_TO_4(RX_BUF_DATA_OFFSET          \
      + MAX_PAYLOAD_LEN \
      + RX_BUF_METADATA_SIZE)

/*
 * RX buffers.
 * PROP_MODE_RX_BUF_CNT buffers of RX_BUF_SIZE bytes each. The start of each
 * buffer must be 4-byte aligned, therefore RX_BUF_SIZE must divide by 4
 */
static uint8_t rx_buf[PROP_MODE_RX_BUF_CNT][RX_BUF_SIZE] CC_ALIGN(4);

/* The RX Data Queue */
static dataQueue_t rx_data_queue = { 0 };

/* Receive entry pointer to keep track of read items */
volatile static uint8_t *rx_read_entry;
/*---------------------------------------------------------------------------*/
/*
 * Increasing this number causes unicast Tx immediately after broadcast Rx to have
 * negative synchronization errors ("dr" in TSCH logs); decreasing it: the opposite.
 */
#define RAT_TIMESTAMP_OFFSET_SUB_GHZ USEC_TO_RADIO(160 * 6 - 240)
/*---------------------------------------------------------------------------*/
/* SFD timestamp in RTIMER ticks */
//static volatile uint32_t last_packet_timestamp = 0;
/* XXX: don't know what exactly is this, looks like the time to Tx 3 octets */
#define TIMESTAMP_OFFSET  -(USEC_TO_RADIO(32 * 3) - 1) /* -95.75 usec */



#if PROP_MODE_RAT_SYNC_STYLE >= PROP_MODE_RAT_SYNC_AGRESSIVE
void   rat_sync_op_start(void);
void   rat_sync_op_end(void);
rtimer_clock_t   rat_sync_check(rtimer_clock_t stamp);
#else
#define   rat_sync_op_start(...)
#define   rat_sync_op_end(...)
#define   rat_sync_check(x) x
#endif
/*---------------------------------------------------------------------------*/
/* The outgoing frame buffer */
#define TX_BUF_PAYLOAD_LEN 180
#define TX_BUF_HDR_LEN       2

static uint8_t tx_buf[TX_BUF_HDR_LEN + TX_BUF_PAYLOAD_LEN] CC_ALIGN(4);
/*---------------------------------------------------------------------------*/
static
bool rx_is_on(void)
{
  if(!rf_core_is_accessible()) {
    return 0;
  }

  return v_cmd_rx.status == RF_CORE_RADIO_OP_STATUS_ACTIVE;
}
/*---------------------------------------------------------------------------*/
static uint8_t
rf_is_on(void)
{
  if(!rf_core_is_accessible()) {
    return 0;
  }

  return rf_status;
}
/*---------------------------------------------------------------------------*/
static
bool transmitting(void)
{
  return v_cmd_tx.status == RF_CORE_RADIO_OP_STATUS_ACTIVE;
}
/*---------------------------------------------------------------------------*/
static
int_fast8_t read_rssi(void){
    uint32_t cmd_status;
    unsigned char attempts = 0;
    rfc_CMD_GET_RSSI_t cmd;
    int_fast8_t rssi;
    rssi = RF_CORE_CMD_CCA_REQ_RSSI_UNKNOWN;

    while((rssi == RF_CORE_CMD_CCA_REQ_RSSI_UNKNOWN || rssi == 0) && ++attempts < 10) {
      cmd.commandNo = CMD_GET_RSSI;

      if(rf_core_send_cmd((uint32_t)&cmd, &cmd_status) == RF_CORE_CMD_ERROR) {
        PRINTF("get_rssi: CMDSTA=0x%08lx\n", cmd_status);
        break;
      } else {
        /* Current RSSI in bits 23:16 of cmd_status */
        rssi = (int8_t)((cmd_status >> 16) & 0xFF);
      }
    }
    //if (poll_mode)
    // TODO is LAST_RSSI should takes this value, even when read_frame assigs it?
        rssi_last = rssi;
    return rssi;
}


static radio_value_t
get_rssi(void)
{
  int_fast8_t rssi;
  int_fast8_t was_off = 0;

  /* If we are off, turn on first */
  if(!rf_is_on()) {
    was_off = 1;
    if(on() != RF_CORE_CMD_OK) {
      PRINTF("get_rssi: on() failed\n");
      return RF_CORE_CMD_CCA_REQ_RSSI_UNKNOWN;
    }
  }

  rssi = read_rssi();

