dylandelaporte/contiki/arch/cpu/cc26x0-cc13x0/rf-core/prop-mode.c
  ((rfc_dataEntry_t *)rx_buf[PROP_MODE_RX_BUF_CNT - 1])->pNextEntry = rx_buf[0];
}
/*---------------------------------------------------------------------------*/
static int
rx_on_prop(void)
{
  int ret;

  if(rx_is_on()) {
    PRINTF("rx_on_prop: We were on. PD=%u, RX=0x%04x\n",
           rf_core_is_accessible(), settings_cmd_prop_rx_adv.status);
    return RF_CORE_CMD_OK;
  }

#if (RF_CORE_RECV_STYLE == RF_CORE_RECV_BY_SYNC)
  /* Make sure the flag is reset */
  is_receiving_packet = 0;
#endif

  /* Put CPE in RX using the currently configured parameters */
  ret = rf_cmd_prop_rx();

  if(ret) {
    ENERGEST_ON(ENERGEST_TYPE_LISTEN);
  }

  return ret;
}
/*---------------------------------------------------------------------------*/
static int
rx_off_prop(void)
{
  uint32_t cmd_status;
  int ret;

  /* If we are off, do nothing */
  if(!rf_is_on()) {
    rat_sync_op_end();
    return RF_CORE_CMD_OK;
  }

#if (RF_CORE_RECV_STYLE == RF_CORE_RECV_BY_SYNC)
  /* Make sure the flag is reset */
  is_receiving_packet = 0;
#endif

  /* Wait for ongoing ACK TX to finish */
  RTIMER_BUSYWAIT_UNTIL(!transmitting(), RF_CORE_TX_FINISH_TIMEOUT);

  /* Send a CMD_ABORT command to RF Core */
  if(rf_core_send_cmd(CMDR_DIR_CMD(CMD_ABORT), &cmd_status) == RF_CORE_CMD_ERROR) {
    PRINTF("rx_off_prop: CMD_ABORT status=0x%08lx\n", cmd_status);
    /* Continue nonetheless */
  }

  RTIMER_BUSYWAIT_UNTIL(!rx_is_on(), RF_CORE_TURN_OFF_TIMEOUT);

  if(settings_cmd_prop_rx_adv.status == PROP_DONE_STOPPED ||
     settings_cmd_prop_rx_adv.status == PROP_DONE_ABORT) {
    /* Stopped gracefully */
    ENERGEST_OFF(ENERGEST_TYPE_LISTEN);
    ret = RF_CORE_CMD_OK;
  } else {
    PRINTF("rx_off_prop: status=0x%04x\n",
           settings_cmd_prop_rx_adv.status);
    ret = RF_CORE_CMD_ERROR;
  }

  rat_sync_op_end();

  return ret;
}
/*---------------------------------------------------------------------------*/
static uint8_t
request(void)
{
  /*
   * We rely on the RDC layer to turn us on and off. Thus, if we are on we
   * will only allow sleep, standby otherwise
   */
  if(rf_is_on()) {
    return LPM_MODE_SLEEP;
  }

  return LPM_MODE_MAX_SUPPORTED;
}
/*---------------------------------------------------------------------------*/
LPM_MODULE(prop_lpm_module, request, NULL, NULL, LPM_DOMAIN_NONE);
/*---------------------------------------------------------------------------*/
// this handler provides to update_prop for refresh FS settings
static int
prop_fs(void)
{
  rfc_radioOp_t *cmd = (rfc_radioOp_t *)&settings_cmd_prop_fs;
  return rf_cmd_execute(cmd, "prop_fs: CMD_FS");
}

// this handler provides to update_prop for refresh power settings
static
int prop_txpower(void){
    rfc_CMD_SET_TX_POWER_t cmd_power =
    {
      .commandNo    = CMD_SET_TX_POWER,
      .txPower      = tx_power_current->tx_power,
    };

    rfc_radioOp_t *cmd = (rfc_radioOp_t *)&cmd_power;
    return rf_cmd_execute(cmd, "prop_txpower: CMD_SET_TX_POWER");
}

/*---------------------------------------------------------------------------*/
static void
soft_off_prop(void)
{
  uint32_t cmd_status;
  volatile rfc_radioOp_t *cmd = rf_core_get_last_radio_op();

  if(!rf_core_is_accessible()) {
    return;
  }

  /* Send a CMD_ABORT command to RF Core */
  if(rf_core_send_cmd(CMDR_DIR_CMD(CMD_ABORT), &cmd_status) != RF_CORE_CMD_OK) {
    PRINTF("soft_off_prop: CMD_ABORT status=0x%08lx\n", cmd_status);
    return;
  }

  RTIMER_BUSYWAIT_UNTIL(!rf_cmd_status_is_running(cmd), RF_CORE_TURN_OFF_TIMEOUT);
}
/*---------------------------------------------------------------------------*/
static uint8_t
soft_on_prop(void)
{
  if(prop_div_radio_setup() != RF_CORE_CMD_OK) {
    PRINTF("soft_on_prop: prop_div_radio_setup() failed\n");
    return RF_CORE_CMD_ERROR;
  }

  if(prop_fs() != RF_CORE_CMD_OK) {
    PRINTF("soft_on_prop: prop_fs() failed\n");
    return RF_CORE_CMD_ERROR;
  }

  return rx_on_prop();
}
/*---------------------------------------------------------------------------*/
static const rf_core_primary_mode_t mode_prop = {
  soft_off_prop,
  soft_on_prop,
  rf_is_on,
  RAT_TIMESTAMP_OFFSET_SUB_GHZ
};
/*---------------------------------------------------------------------------*/
static int
init(void)
{
  lpm_register_module(&prop_lpm_module);

  if(   (ti_lib_chipinfo_chip_family_is_cc13xx() == false)
     && (ti_lib_chipinfo_chip_family_is_cc26xx() == false)
     )
  {
    return RF_CORE_CMD_ERROR;
  }

  //* if CPU reset during radio active, ensure radio is downed, to avoid
  //    concurent access to uninitialised buffers
  rf_core_power_down();

#if RF_TX_POWER_TABLE_STYLE == RF_TX_POWER_TABLE_SIMPLELINK
  tx_power_current = rfc_tx_power_last_element(TX_POWER_DRIVER);
  assert(tx_power_current > TX_POWER_DRIVER);
  --tx_power_current;
#endif

  /* Initialise RX buffers */
  memset(rx_buf, 0, sizeof(rx_buf));

  /* Set of RF Core data queue. Circular buffer, no last entry */
  rx_data_queue.pCurrEntry = rx_buf[0];
  rx_data_queue.pLastEntry = NULL;

  /* Initialize current read pointer to first element (used in ISR) */
  rx_read_entry = rx_buf[0];

  settings_cmd_prop_rx_adv.pQueue = &rx_data_queue;
  settings_cmd_prop_rx_adv.pOutput = (uint8_t *)&rx_stats;

  // for normal RX operation need continous receive enabled
  settings_cmd_prop_rx_adv.pktConf.bRepeatOk    = 1;
  settings_cmd_prop_rx_adv.pktConf.bRepeatNok   = 1;

  // receiver better expose bad frames to app, to show broken packets recv.
  settings_cmd_prop_rx_adv.rxConf.bAutoFlushIgnored = 0;
  settings_cmd_prop_rx_adv.rxConf.bAutoFlushCrcErr  = 0;

  // this need by read frame parser
  settings_cmd_prop_rx_adv.rxConf.bIncludeHdr       = 0;
  settings_cmd_prop_rx_adv.rxConf.bIncludeCrc       = 0;
  settings_cmd_prop_rx_adv.rxConf.bAppendRssi       = 0x1;
  settings_cmd_prop_rx_adv.rxConf.bAppendTimestamp  = 0x1;
  settings_cmd_prop_rx_adv.rxConf.bAppendStatus     = 0x1;
  if ( settings_cmd_prop_rx_adv.hdrConf.numHdrBits != 16 )
      PRINTF_FAIL("suspicious settings_cmd_prop_rx_adv:hdrConf.numHdrBits\n");

