dylandelaporte/contiki/arch/cpu/cc26x0-cc13x0/rf-core/prop-mode.c
  set_channel(IEEE802154_DEFAULT_CHANNEL);

  if(on() != RF_CORE_CMD_OK) {
    PRINTF("init: on() failed\n");
    return RF_CORE_CMD_ERROR;
  }

  rf_core_primary_mode_register(&mode_prop);

  rf_core_rat_init();

  //* have probed that RFcore ok, turn it off for power-save
  off();

  ENERGEST_ON(ENERGEST_TYPE_LISTEN);

  process_start(&rf_core_process, NULL);

  return 1;
}
/*---------------------------------------------------------------------------*/
static int transmited(void);

#if RF_CORE_APP_HANDLING
radio_app_handle    rf_prop_tx_handle;
radio_app_handle    rf_prop_rx_handle;

void rfprop_transmit_isr(uint32_t irqflags){
    if (rf_prop_tx_handle){
        int ok = transmited();
        (*rf_prop_tx_handle)(ok);
        rf_prop_tx_handle = NULL;
    }
    rf_prop_rx_handle = NULL;
}

void rfprop_receive_isr(uint32_t irqflags){
    if (rf_prop_rx_handle){
        int ok = ((irqflags & IRQ_RX_ENTRY_DONE) != 0);
        (*rf_prop_rx_handle)(ok);
        rf_prop_rx_handle = NULL;
    }
    rf_prop_tx_handle = NULL;
}

static
void rfprop_happ_reset(){
    rf_prop_tx_handle = NULL;
    rf_prop_rx_handle = NULL;
}

#else
static void rfprop_happ_reset(){;}
#endif
/*---------------------------------------------------------------------------*/
static int
prepare(const void *payload, unsigned short payload_len)
{
  if(payload_len > TX_BUF_PAYLOAD_LEN || payload_len > MAX_PAYLOAD_LEN) {
    return RADIO_TX_ERR;
  }

  memcpy(&tx_buf[TX_BUF_HDR_LEN], payload, payload_len);
  return 0;
}
/*---------------------------------------------------------------------------*/
static uint8_t was_off = 0;
static int
transmit(unsigned short transmit_len)
{
  int ret;
  uint32_t cmd_status;
  volatile rfc_CMD_PROP_TX_ADV_t *cmd_tx_adv;

  /* Length in .15.4g PHY HDR. Includes the CRC but not the HDR itself */
  uint16_t total_length;

  if(transmit_len > MAX_PAYLOAD_LEN) {
    PRINTF("transmit: too long\n");
    return RADIO_TX_ERR;
  }

  was_off = !rf_is_on();
  if(was_off) {
    if(on() != RF_CORE_CMD_OK) {
      PRINTF("transmit: on() failed\n");
      return RADIO_TX_ERR;
    }
  }

  /*
   * Prepare the .15.4g PHY header
   * MS=0, Length MSBits=0, DW and CRC configurable
   * Total length = transmit_len (payload) + CRC length
   *
   * The Radio will flip the bits around, so tx_buf[0] must have the length
   * LSBs (PHR[15:8] and tx_buf[1] will have PHR[7:0]
   */
  total_length = transmit_len + CRC_LEN;

  tx_buf[0] = total_length & 0xFF;
  tx_buf[1] = (total_length >> 8) + DOT_4G_PHR_DW_BIT + DOT_4G_PHR_CRC_BIT;

  /* Prepare the CMD_PROP_TX_ADV command */
  cmd_tx_adv = (rfc_CMD_PROP_TX_ADV_t *)&settings_cmd_prop_tx_adv;

  /*
   * pktLen: Total number of bytes in the TX buffer, including the header if
   * one exists, but not including the CRC (which is not present in the buffer)
   */
  cmd_tx_adv->pktLen = transmit_len + DOT_4G_PHR_LEN;
  cmd_tx_adv->pPkt = tx_buf;

  /* Abort RX */
  rx_off_prop();

  /* Enable the LAST_COMMAND_DONE interrupt to wake us up */
  rf_core_cmd_done_en(false);

  ret = rf_core_send_cmd((uint32_t)cmd_tx_adv, &cmd_status);

  if(ret){
      /* If we enter here, TX actually started */
      ENERGEST_SWITCH(ENERGEST_TYPE_LISTEN, ENERGEST_TYPE_TRANSMIT);
      watchdog_periodic();
  }
  else {
      /* Failure sending the CMD_PROP_TX command */
      PRINTF("transmit: PROP_TX_ERR ret=%d, CMDSTA=0x%08lx, status=0x%04x\n",
             ret, cmd_status, cmd_tx_adv->status);
      ret = RADIO_TX_ERR;
      rfprop_happ_reset();
  }
#if RF_CORE_APP_HANDLING
  rf_prop_rx_handle = NULL;
  if (rf_prop_tx_handle){
      rf_core_arm_app_handle(rfprop_transmit_isr, IRQ_COMMAND_DONE);
      return RADIO_TX_SCHEDULED;
  }
#endif
  return transmited();
}

static
int transmited(void) {
    int ret;
    volatile rfc_CMD_PROP_TX_ADV_t *cmd_tx_adv;
    cmd_tx_adv = (rfc_CMD_PROP_TX_ADV_t *)&settings_cmd_prop_tx_adv;

    /* Idle away while the command is running */
    while((cmd_tx_adv->status & RF_CORE_RADIO_OP_MASKED_STATUS)
          == RF_CORE_RADIO_OP_MASKED_STATUS_RUNNING) {
      /* Note: for now sleeping while Tx'ing in polling mode is disabled.
       * To enable it:
       *  1) make the `lpm_sleep()` call here unconditional;
       *  2) change the radio ISR priority to allow radio ISR to interrupt rtimer ISR.
       */
      if(!rf_core_poll_mode) {
        lpm_sleep();
      }
    }

    if(cmd_tx_adv->status == RF_CORE_RADIO_OP_STATUS_PROP_DONE_OK) {
      /* Sent OK */
      RIMESTATS_ADD(lltx);
      ret = RADIO_TX_OK;
    } else {
      /* Operation completed, but frame was not sent */
      PRINTF("transmit: Not Sent OK status=0x%04x\n",
             cmd_tx_adv->status);
      ret = RADIO_TX_ERR;
    }

  /*
   * Update ENERGEST state here, before a potential call to off(), which
   * will correctly update it if required.
   */
  ENERGEST_SWITCH(ENERGEST_TYPE_TRANSMIT, ENERGEST_TYPE_LISTEN);

  /*
   * Disable LAST_FG_COMMAND_DONE interrupt. We don't really care about it
   * except when we are transmitting
   */
  rf_core_cmd_done_dis();

  /* Workaround. Set status to IDLE */
  cmd_tx_adv->status = RF_CORE_RADIO_OP_STATUS_IDLE;

  if(!was_off)
  rx_on_prop();
  else {
    off();
  }

  return ret;
}
/*---------------------------------------------------------------------------*/
static int
send(const void *payload, unsigned short payload_len)
{
  prepare(payload, payload_len);
  return transmit(payload_len);
}
/*---------------------------------------------------------------------------*/
static void
release_data_entry(void)
{
  rfc_dataEntryGeneral_t *entry = (rfc_dataEntryGeneral_t *)rx_read_entry;
  uint8_t *data_ptr = &entry->data;

  /* Clear the length field (2 bytes) */
  data_ptr[0] = 0;
  data_ptr[1] = 0;

  /* Set status to 0 "Pending" in element */
  entry->status = DATA_ENTRY_STATUS_PENDING;
  rx_read_entry = entry->pNextEntry;

  if(!rx_is_on()) {
    PRINTF("RX was off, re-enabling rx!\n");
    rx_on_prop();
  }
}
/*---------------------------------------------------------------------------*/
static int
read_frame(void *buf, unsigned short buf_len)
{
  rfc_dataEntryGeneral_t *entry = (rfc_dataEntryGeneral_t *)rx_read_entry;
  uint8_t *data_ptr;
  int len = 0;

