dylandelaporte/contiki/arch/cpu/cc26x0-cc13x0/rf-core/prop-mode.c
  int is_found = 0;
  /* Go through all RX buffers and check their status */
  do {
    if( entry->status >= DATA_ENTRY_STATUS_FINISHED
        || entry->status == DATA_ENTRY_STATUS_BUSY) {
      is_found = 1;
      break;
    }

    entry = (rfc_dataEntryGeneral_t *)entry->pNextEntry;
  } while(entry != (rfc_dataEntryGeneral_t *)rx_read_entry);

  if(is_found == 0) {
    /* No available data */
    return 0;
  }

  rx_read_entry = (volatile uint8_t *)entry;

  /* wait for entry to become finished */
  rtimer_clock_t t0 = RTIMER_NOW();
  while(entry->status == DATA_ENTRY_STATUS_BUSY
      && RTIMER_CLOCK_LT(RTIMER_NOW(), t0 + (RTIMER_SECOND / 50)));

#if (RF_CORE_RECV_STYLE == RF_CORE_RECV_BY_SYNC)
  /* Make sure the flag is reset */
  is_receiving_packet = 0;
#endif

  if(entry->status != DATA_ENTRY_STATUS_FINISHED) {
    /* No available data */
    return 0;
  }

  /*
   * First 2 bytes in the data entry are the length.
   * Our data entry consists of:
   *   Payload + RSSI (1 byte) + Timestamp (4 bytes) + Status (1 byte)
   * This length includes all of those.
   */
  data_ptr = &entry->data;
  len = (*(uint16_t *)data_ptr);

  if(len <= RX_BUF_METADATA_SIZE) {
    PRINTF("RF: too short!");

    release_data_entry();
    return 0;
  }

  data_ptr += 2;
  len -= RX_BUF_METADATA_SIZE;

  if(len > buf_len) {
    PRINTF("RF: too long\n");

    release_data_entry();
    return 0;
  }

  struct rfc_propRxStatus_s* status = (struct rfc_propRxStatus_s*)&data_ptr[len + 5];
  enum propRxStatus{
      stOK      = 0,
      stERR_CRC = 1,
      stIGNORE  = 2,
      stABORT   = 3,
  };
  if (status->status.result != stOK){
      PRINTF("RF: recv bad frame :%u\n", status->status.result);
      release_data_entry();
      data_ptr[0] = *(uint8_t*)status;
      // return 1byte frame - since it is mostly invalid size, and it shows that
      //    received bad frame
      return 1;
  }

  memcpy(buf, data_ptr, len);

  /* get the RSSI and status */
  rf_core_last_rssi = (int8_t)data_ptr[len];

  /* get the timestamp */
  uint32_t rat_timestamp;
#if 1
  memcpy(&rat_timestamp, data_ptr + len + 1, 4);
  rat_timestamp += TIMESTAMP_OFFSET;
#else
  //! TODO in PollMode rx_stats may inconsistent, when ISR looks over multiple IRQs
  /* correct timestamp so that it refers to the end of the SFD */
  rat_timestamp = rx_stats.timeStamp + TIMESTAMP_OFFSET;
#endif
  rf_rat_last_timestamp(rat_timestamp);

  if(!rf_core_poll_mode) {
    /* Not in poll mode: packetbuf should not be accessed in interrupt context.
     * In poll mode, the last packet RSSI and link quality can be obtained through
     * RADIO_PARAM_LAST_RSSI and RADIO_PARAM_LAST_LINK_QUALITY */
    packetbuf_set_attr(PACKETBUF_ATTR_RSSI, rf_core_last_rssi);
  }

  release_data_entry();

  return len;
}
/*---------------------------------------------------------------------------*/
static int
channel_clear(void)
{
  uint8_t was_off = 0;
  int8_t rssi = RF_CORE_CMD_CCA_REQ_RSSI_UNKNOWN;

  /*
   * If we are in the middle of a BLE operation, we got called by ContikiMAC
   * from within an interrupt context. Indicate a clear channel
   */
  if(rf_ble_is_active() == RF_BLE_ACTIVE) {
    return RF_CORE_CCA_CLEAR;
  }

  if(!rf_core_is_accessible()) {
    was_off = 1;
    if(on() != RF_CORE_CMD_OK) {
      PRINTF("channel_clear: on() failed\n");
      if(was_off) {
        off();
      }
      return RF_CORE_CCA_CLEAR;
    }
  } else {
    if(transmitting()) {
      PRINTF("channel_clear: called while in TX\n");
      return RF_CORE_CCA_CLEAR;
    }
  }

  rssi = read_rssi();

  if(was_off) {
    off();
  }

  if(rssi >= rssi_threshold) {
    return RF_CORE_CCA_BUSY;
  }

  return RF_CORE_CCA_CLEAR;
}
/*---------------------------------------------------------------------------*/
static int
receiving_packet(void)
{
  if(!rf_is_on()) {
    return 0;
  }

#if (RF_CORE_RECV_STYLE == RF_CORE_RECV_BY_SYNC)

#if !MAC_CONF_WITH_TSCH
#pragma warning ( "RF_CORE_RECV_BY_SYNC well tested only with TSCH stack" )
#endif
  /*
   * Under TSCH operation, we rely on "hints" from the MDMSOFT interrupt
   * flag. This flag is set by the radio upon sync word detection, but it is
   * not cleared automatically by hardware. We store state in a variable after
   * first call. The assumption is that the TSCH code will keep calling us
   * until frame reception has completed, at which point we can clear MDMSOFT.
   */
  if(is_receiving_packet == NULL) {
    /* Look for the modem synchronization word detection interrupt flag.
     * This flag is raised when the synchronization word is received.
     */
    if(HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFHWIFG) & RFC_DBELL_RFHWIFG_MDMSOFT) {
      is_receiving_packet = (rfc_dataEntry_t *)rx_data_queue.pCurrEntry;;
    }
  } else {
    /* After the start of the packet: reset the Rx flag once the channel gets clear */
    //if (channel_clear() != RF_CORE_CCA_BUSY)
    if (is_receiving_packet->status >= DATA_ENTRY_STATUS_FINISHED)
    {
        is_receiving_packet = NULL;
        /* Clear the modem sync flag */
        ti_lib_rfc_hw_int_clear(RFC_DBELL_RFHWIFG_MDMSOFT);
    }
  }

  return is_receiving_packet != NULL;
#else
  /*
   * Under CSMA operation, there is no immediately straightforward logic as to
   * when it's OK to clear the MDMSOFT interrupt flag:
   *
   *   - We cannot re-use the same logic as above, since CSMA may bail out of
   *     frame TX immediately after a single call this function here. In this
   *     scenario, is_receiving_packet would remain equal to one and we would
   *     therefore erroneously signal ongoing RX in subsequent calls to this
   *     function here, even _after_ reception has completed.
   *   - We can neither clear inside read_frame() nor inside the RX frame
   *     interrupt handler (remember, we are not in poll mode under CSMA),
   *     since we risk clearing MDMSOFT after we have seen a sync word for the
   *     _next_ frame. If this happens, this function here would incorrectly
   *     return 0 during RX of this next frame.
   *
   * So to avoid a very convoluted logic of how to handle MDMSOFT, we simply
   * perform a clear channel assessment here: We interpret channel activity
   * as frame reception.
   */

  if(channel_clear() == RF_CORE_CCA_CLEAR) {
    return 0;
  }

  return 1;

#endif
}
/*---------------------------------------------------------------------------*/
static int
pending_packet(void)
{
  int rv = 0;
#if RF_CORE_PENDING == RF_CORE_PENDING_READS
  volatile rfc_dataEntry_t *entry = (rfc_dataEntry_t *)rx_read_entry;
#else
  volatile rfc_dataEntry_t *entry = (rfc_dataEntry_t *)rx_data_queue.pCurrEntry;
#endif

  /* Go through all RX buffers and check their status */
  do {
    if(entry->status >= DATA_ENTRY_STATUS_FINISHED
        || entry->status == DATA_ENTRY_STATUS_BUSY) {
      rv += 1;
      if(!rf_core_poll_mode) {
        process_poll(&rf_core_process);
      }
    }
#if RF_CORE_PENDING == RF_CORE_PENDING_READS
    else
        break;
#endif

    entry = (rfc_dataEntry_t *)entry->pNextEntry;
  } while(entry != (rfc_dataEntry_t *)rx_data_queue.pCurrEntry);

  /* If we didn't find an entry at status finished, no frames are pending */
  return rv;
}
/*---------------------------------------------------------------------------*/
#include <pwr_ctrl.h>
static uint32_t power_style_save;
static
int rf_power_up(){
    if (power_style == RADIO_POWER_STYLE_GLDO){
        power_style_save = PowerCtrlSourceGet();
        if (power_style_save != PWRCTRL_PWRSRC_GLDO)
            PowerCtrlSourceSet(PWRCTRL_PWRSRC_GLDO);
    }
    return rf_core_power_up();
}

static
void rf_power_down(){
    rf_core_power_down();
    if (power_style != RADIO_POWER_STYLE_FREE) {
        if (PowerCtrlSourceGet() != power_style_save)
            PowerCtrlSourceSet(power_style_save);
    }

    // aborts last operation, handle, since it should install in online radio
    rfprop_happ_reset();
}

static int
on(void)
{
    // aborts last operation, handle, since it should install in online radio
    // TODO: maybe should reinstall AppHandle at poweron?
    rfprop_happ_reset();

