dylandelaporte/contiki/arch/cpu/cc26x0-cc13x0/rf-core/prop-mode.c
  /*
   * If we are in the middle of a BLE operation, we got called by ContikiMAC
   * from within an interrupt context. Abort, but pretend everything is OK.
   */
  if(rf_ble_is_active() == RF_BLE_ACTIVE) {
    return RF_CORE_CMD_OK;
  }

  /* Read available RF modes from the PRCM register */
  uint32_t availableRfModes = HWREG(PRCM_BASE + PRCM_O_RFCMODEHWOPT);

  /* Verify that the provided configuration is supported by this device.
     Reject any request which is not compliant. */
  if ( (availableRfModes & (1 << settings_prop_mode.rfMode)) == 0 ){
      PRINTF("on: rf_core_power_up() RF mode not supports\n");
      return RF_CORE_CMD_ERROR;
  }

  /*
   * Request the HF XOSC as the source for the HF clock. Needed before we can
   * use the FS. This will only request, it will _not_ perform the switch.
   */
  oscillators_request_hf_xosc();
#if (RF_CORE_HFOSC_STARTUP_TOUS > 0)
  rtimer_clock_t hf_start_time = RTIMER_NOW();
#endif


  if(rf_is_on()) {
    PRINTF("on: We were on. PD=%u, RX=0x%04x \n", rf_core_is_accessible(),
           settings_cmd_prop_rx_adv.status);
    return RF_CORE_CMD_OK;
  }

  if(!rf_core_is_accessible()) {
    if(rf_power_up() != RF_CORE_CMD_OK) {
      PRINTF("on: rf_core_power_up() failed\n");

      rf_power_down();

      return RF_CORE_CMD_ERROR;
    }

    /* Keep track of RF Core mode */
    HWREG(PRCM_BASE + PRCM_O_RFCMODESEL) = settings_prop_mode.rfMode;

    /* Apply patches to radio core */
    if (settings_prop_mode.cpePatchFxn)
        settings_prop_mode.cpePatchFxn();

    rfc_dbell_sync_on_ack();

    if (settings_prop_mode.mcePatchFxn)
        settings_prop_mode.mcePatchFxn();
    if (settings_prop_mode.rfePatchFxn)
        settings_prop_mode.rfePatchFxn();

    /* Initialize bus request */
    rfc_dbell_submit_cmd_async( CMDR_DIR_CMD_1BYTE(CMD_BUS_REQUEST, 1) );

    /* set VCOLDO reference */
    ti_lib_rfc_adi3vco_ldo_voltage_mode(true);

    /* Let CC13xxware automatically set a correct value for RTRIM for us */
    ti_lib_rfc_override_update((rfc_radioOp_t *)&settings_cmd_prop_radio_div_setup
                                , NULL);

    /* Make sure BUS_REQUEST is done */
    rfc_dbell_sync_on_ack();

    if(rf_core_start_rat() != RF_CORE_CMD_OK) {
      PRINTF("on: rf_core_start_rat() failed\n");

      rf_power_down();

      return RF_CORE_CMD_ERROR;
    }
    rf_rat_check_overflow(true);
  }

#if (RF_CORE_HFOSC_STARTUP_TOUS > 0)
  const unsigned hf_start_timeout = US_TO_RTIMERTICKS(RF_CORE_HFOSC_STARTUP_TOUS);
  rtimer_clock_t hf_start_limit = hf_start_time + hf_start_timeout;
  if( !oscillators_wait_ready_hf_xosc(hf_start_limit) ){
      PRINTF("on: rf_core_start_rat() failed start HF\n");
      rf_power_down();
      trace_rf_on_off();
      return RF_CORE_CMD_ERROR;
  }
#endif

  rf_core_setup_interrupts();

  init_rx_buffers();

  /*
   * Trigger a switch to the XOSC, so that we can subsequently use the RF FS
   * This will block until the XOSC is actually ready, but give how we
   * requested it early on, this won't be too long a wait/
   */
  oscillators_switch_to_hf_xosc();

  //* apply setup radio chanel settings
  if (soft_on_prop() != RF_CORE_CMD_ERROR) {
    rf_status = 1;
    return RF_CORE_CMD_OK;
    }
  if ((rf_core_cmd_status()& RF_CORE_CMDSTA_RESULT_MASK) == RF_CORE_CMDSTA_SCHEDULING_ERR){
      //looks there was alredy pended command of radio, but app expects radio
      //    is turn on, and ready. So, abort any commans, and retry setup.

      /* Send a CMD_ABORT command to RF Core */
      if( rf_core_start_cmd(CMDR_DIR_CMD(CMD_ABORT)) == RF_CORE_CMD_ERROR) {
        PRINTF_FAIL("on: CMD_ABORT status=0x%08lx\n", rf_core_cmd_status());
        /* Continue nonetheless */
        return RF_CORE_CMD_ERROR;
      }

      // retry setup online
      if (soft_on_prop()  != RF_CORE_CMD_ERROR) {
        rf_status = 1;
        return RF_CORE_CMD_OK;
      }
      PRINTF_FAIL("on: retry with status=0x%08lx\n", rf_core_cmd_status());
  }

  return RF_CORE_CMD_ERROR;
}

/*---------------------------------------------------------------------------*/
static int
off(void)
{
  // aborts last operation, handle, since it should install in online radio
  rfprop_happ_reset();

  /*
   * If we are in the middle of a BLE operation, we got called by ContikiMAC
   * from within an interrupt context. Abort, but pretend everything is OK.
   */
  if(rf_ble_is_active() == RF_BLE_ACTIVE) {
    return RF_CORE_CMD_OK;
  }

  rx_off_prop();
  rf_power_down();

  ENERGEST_OFF(ENERGEST_TYPE_LISTEN);

#if !CC2650_FAST_RADIO_STARTUP
  /* Switch HF clock source to the RCOSC to preserve power */
  oscillators_switch_to_hf_rc();
#endif

  /* We pulled the plug, so we need to restore the status manually */
  settings_cmd_prop_rx_adv.status = RF_CORE_RADIO_OP_STATUS_IDLE;

  /*
   * Just in case there was an ongoing RX (which started after we begun the
   * shutdown sequence), we don't want to leave the buffer in state == ongoing
   */
  int i;
  rfc_dataEntry_t *entry;
  for(i = 0; i < PROP_MODE_RX_BUF_CNT; i++) {
    entry = (rfc_dataEntry_t *)rx_buf[i];
    if(entry->status == DATA_ENTRY_STATUS_BUSY) {
       entry->status = DATA_ENTRY_STATUS_PENDING;
    }
  }

  rf_status = 0;

  return RF_CORE_CMD_OK;
}
/*---------------------------------------------------------------------------*/
/* Enable or disable CCA before sending */
static radio_result_t
set_send_on_cca(uint8_t enable)
{
  if(enable) {
    /* this driver does not have support for CCA on Tx */
    return RADIO_RESULT_NOT_SUPPORTED;
  }
  return RADIO_RESULT_OK;
}
/*---------------------------------------------------------------------------*/
static radio_result_t
get_value(radio_param_t param, radio_value_t *value)
{
  if(!value) {
    return RADIO_RESULT_INVALID_VALUE;
  }

  switch(param) {
  case RADIO_PARAM_POWER_MODE:
    /* On / off */
    *value = rf_is_on() ? RADIO_POWER_MODE_ON : RADIO_POWER_MODE_OFF;
    return RADIO_RESULT_OK;
  case RADIO_PARAM_CHANNEL:
    *value = (radio_value_t)get_channel();
    return RADIO_RESULT_OK;
  case RADIO_PARAM_RX_MODE:
    *value = 0;
    //*  filtering need to implements
    //*  *value |= RADIO_RX_MODE_ADDRESS_FILTER;
    //*  AUTOACK not supports in pop-mode
    //*  *value |= RADIO_RX_MODE_AUTOACK;
    if(rf_core_poll_mode) {
      *value |= RADIO_RX_MODE_POLL_MODE;
    }
    return RADIO_RESULT_OK;
  case RADIO_PARAM_TX_MODE:
    *value = 0;
    return RADIO_RESULT_OK;
  case RADIO_PARAM_TXPOWER:
    *value = get_tx_power();
    return RADIO_RESULT_OK;
  case RADIO_PARAM_CCA_THRESHOLD:
    *value = rssi_threshold;
    return RADIO_RESULT_OK;
  case RADIO_PARAM_RSSI:
    *value = get_rssi();

    if(*value == RF_CORE_CMD_CCA_REQ_RSSI_UNKNOWN) {
      return RADIO_RESULT_ERROR;
    } else {
      return RADIO_RESULT_OK;
    }
  case RADIO_CONST_CHANNEL_MIN:
    *value = 0;
    return RADIO_RESULT_OK;
  case RADIO_CONST_CHANNEL_MAX:
    *value = DOT_15_4G_CHANNEL_MAX;
    return RADIO_RESULT_OK;
  case RADIO_CONST_TXPOWER_MIN:
    *value = OUTPUT_POWER_MIN;
    return RADIO_RESULT_OK;
  case RADIO_CONST_TXPOWER_MAX:
    *value = OUTPUT_POWER_MAX;
    return RADIO_RESULT_OK;
  case RADIO_PARAM_LAST_RSSI:
    *value = rf_core_last_rssi;
    return RADIO_RESULT_OK;
  case RADIO_PARAM_LAST_LINK_QUALITY:
    *value = rf_core_last_corr_lqi;
    return RADIO_RESULT_OK;
  case RADIO_CONST_PHY_OVERHEAD:
    /* 2 header bytes, 2 or 4 bytes CRC */
    *value = (radio_value_t)(DOT_4G_PHR_LEN + CRC_LEN);
    return RADIO_RESULT_OK;
  case RADIO_CONST_BYTE_AIR_TIME:
    *value = (radio_value_t)RADIO_BYTE_AIR_TIME;
    return RADIO_RESULT_OK;
  case RADIO_CONST_DELAY_BEFORE_TX:
    *value = (radio_value_t)RADIO_DELAY_BEFORE_TX;
    return RADIO_RESULT_OK;
  case RADIO_CONST_DELAY_BEFORE_RX:
    *value = (radio_value_t)RADIO_DELAY_BEFORE_RX;
    return RADIO_RESULT_OK;
  case RADIO_CONST_DELAY_BEFORE_DETECT:
    *value = (radio_value_t)RADIO_DELAY_BEFORE_DETECT;
    return RADIO_RESULT_OK;
  case RADIO_CONST_MAX_PAYLOAD_LEN:
    *value = (radio_value_t)MAX_PAYLOAD_LEN;
    return RADIO_RESULT_OK;
  default:
    return RADIO_RESULT_NOT_SUPPORTED;
  }
}
/*---------------------------------------------------------------------------*/
// provide update RF property sequence enough for curretn radio-mode:
//  waits transmit complete, or breaks/restart receive if it run.
typedef int (*radio_prop_func)(void);
static
radio_result_t update_prop(radio_prop_func f){
    bool is_rx = rx_is_on();
    if (is_rx){
        /* If we reach here we had no errors. Apply new settings */
        if(rx_off_prop() != RF_CORE_CMD_OK) {
        PRINTF("set_value: stop rf failed\n");
        //* fails to stop currrent op, changes take effect on next on()
        return RADIO_RESULT_ERROR;
    }
    }
    else if (transmitting()){
        while (transmitting());
    }
    else {
        /* If off, the new configuration will be applied the next time radio is started */
        return RADIO_RESULT_OK;
    }

    if(f() != RF_CORE_CMD_OK) {
      PRINTF("update_prop: prop failed\n");
      return RADIO_RESULT_ERROR;
    }

    /* Restart the radio timer (RAT).
       This causes resynchronization between RAT and RTC: useful for TSCH. */
    if(rf_core_restart_rat() == RF_CORE_CMD_OK) {
        rf_rat_check_overflow(false);
    }

    if (is_rx){
        if (rx_on_prop() == RF_CORE_CMD_OK)
            return RADIO_RESULT_OK;
        else {
            PRINTF("set_value:rx restart failed\n");
            return RADIO_RESULT_ERROR;
        }
    }
    else
        return RADIO_RESULT_OK;
}
/*---------------------------------------------------------------------------*/
static radio_result_t
set_value(radio_param_t param, radio_value_t value)
{
  radio_result_t rv = RADIO_RESULT_OK;
  uint8_t old_poll_mode;

  switch(param) {
  case RADIO_PARAM_POWER_MODE:
    if(value == RADIO_POWER_MODE_ON) {
      if(on() != RF_CORE_CMD_OK) {
        PRINTF("set_value: on() failed (1)\n");
        return RADIO_RESULT_ERROR;
      }
      return RADIO_RESULT_OK;
    }
    if(value == RADIO_POWER_MODE_OFF) {
      off();
      return RADIO_RESULT_OK;
    }
    return RADIO_RESULT_INVALID_VALUE;

  case RADIO_CC26_POWER_STYLE:
      if (value < RADIO_POWER_STYLE_TOTAL){
          power_style = value;
          return RADIO_RESULT_OK;
      }
      return RADIO_RESULT_INVALID_VALUE;

