dylandelaporte/contiki/arch/cpu/cc26x0-cc13x0/rf-core/prop-mode.c
  case RADIO_PARAM_CHANNEL:
    if(value < 0 ||
       value > DOT_15_4G_CHANNEL_MAX) {
      return RADIO_RESULT_INVALID_VALUE;
    }

    if(get_channel() == (uint8_t)value) {
      /* We already have that very same channel configured.
       * Nothing to do here. */
      return RADIO_RESULT_OK;
    }

    set_channel((uint8_t)value);
    return update_prop(&(prop_fs));

  case RADIO_PARAM_RX_MODE:
      if(value & ~(RADIO_RX_MODE_POLL_MODE)) {
        return RADIO_RESULT_INVALID_VALUE;
      }
      (void)old_poll_mode;
#ifndef RF_CORE_POLL_MODE
      old_poll_mode = rf_core_poll_mode;
      rf_core_poll_mode = (value & RADIO_RX_MODE_POLL_MODE) != 0;
      if(rf_core_poll_mode != old_poll_mode) {
        rf_core_setup_interrupts();
      }
        return RADIO_RESULT_OK;
#else
      if ( (rf_core_poll_mode != 0) == ((value & RADIO_RX_MODE_POLL_MODE) != 0) )
          return RADIO_RESULT_OK;
      else
          return RADIO_RESULT_INVALID_VALUE;
#endif

  case RADIO_PARAM_TX_MODE:
    if(value & ~(RADIO_TX_MODE_SEND_ON_CCA)) {
      return RADIO_RESULT_INVALID_VALUE;
    }
    return set_send_on_cca((value & RADIO_TX_MODE_SEND_ON_CCA) != 0);

  case RADIO_PARAM_TXPOWER:
    if(value < OUTPUT_POWER_MIN || value > OUTPUT_POWER_MAX) {
      return RADIO_RESULT_INVALID_VALUE;
    }

    rv = set_tx_power(value);
    if (rv < (int)RADIO_RESULT_OK)
        return RADIO_RESULT_OK;
    if (rv == RADIO_RESULT_OK)
      return update_prop(&(prop_txpower));
    return rv;

  case RADIO_PARAM_CCA_THRESHOLD:
    rssi_threshold = (int8_t)value;
    break;
  default:
    return RADIO_RESULT_NOT_SUPPORTED;
  }

  /* If off, the new configuration will be applied the next time radio is started */
  if(!rf_is_on()) {
    return RADIO_RESULT_OK;
  }

  /* If we reach here we had no errors. Apply new settings */
  if(rx_off_prop() != RF_CORE_CMD_OK) {
    PRINTF("set_value: rx_off_prop() failed\n");
    rv = RADIO_RESULT_ERROR;
  }

  /* Restart the radio timer (RAT).
     This causes resynchronization between RAT and RTC: useful for TSCH. */
  if(rf_core_restart_rat() != RF_CORE_CMD_OK) {
    PRINTF("set_value: rf_core_restart_rat() failed\n");
    /* do not set the error */
  } else {
    rf_core_check_rat_overflow();
  }

  if(soft_on_prop() != RF_CORE_CMD_OK) {
    PRINTF("set_value: soft_on_prop() failed\n");
    rv = RADIO_RESULT_ERROR;
  }

  return rv;
}
/*---------------------------------------------------------------------------*/
static radio_result_t
get_object(radio_param_t param, void *dest, size_t size)
{
    if(param == RADIO_PARAM_LAST_PACKET_TIMESTAMP) {
      if(size != sizeof(rtimer_clock_t) || !dest) {
        return RADIO_RESULT_INVALID_VALUE;
      }
      rtimer_clock_t stamp = rf_rat_calc_last_rttime();
      *(rtimer_clock_t *)dest = stamp;

      return RADIO_RESULT_OK;
    }
#if RF_CORE_APP_HANDLING
    else if (param == RADIO_ARM_HANDLE_TX){
      if (size != sizeof(radio_app_handle))
          return RADIO_RESULT_INVALID_VALUE;
      *((radio_app_handle*)dest) = rf_prop_tx_handle;
      return RADIO_RESULT_OK;
    }
    else if (param == RADIO_ARM_HANDLE_RX){
      if (size != sizeof(radio_app_handle))
          return RADIO_RESULT_INVALID_VALUE;
      *((radio_app_handle*)dest) = rf_prop_rx_handle;
      return RADIO_RESULT_OK;
    }
#endif

  return RADIO_RESULT_NOT_SUPPORTED;
}
/*---------------------------------------------------------------------------*/
static radio_result_t
set_object(radio_param_t param, const void *src, size_t size)
{
#if RF_CORE_APP_HANDLING
  if (param == RADIO_ARM_HANDLE_RX){
      if (size != sizeof(radio_app_handle))
          return RADIO_RESULT_INVALID_VALUE;
      rf_prop_rx_handle = (radio_app_handle)src;
      if (src != NULL)
          rf_core_arm_app_handle(rfprop_receive_isr, IRQ_COMMAND_DONE | IRQ_RX_ENTRY_DONE );
      else
          rf_core_arm_app_handle(NULL, IRQ_COMMAND_DONE | IRQ_RX_ENTRY_DONE );
      return RADIO_RESULT_OK;
  }
  if (param == RADIO_ARM_HANDLE_TX){
      if (size != sizeof(radio_app_handle))
          return RADIO_RESULT_INVALID_VALUE;
      rf_prop_tx_handle = (radio_app_handle)src;
      return RADIO_RESULT_OK;
  }
#endif
  return RADIO_RESULT_NOT_SUPPORTED;
}
/*---------------------------------------------------------------------------*/
const struct radio_driver prop_mode_driver = {
  init,
  prepare,
  transmit,
  send,
  read_frame,
  channel_clear,
  receiving_packet,
  pending_packet,
  on,
  off,
  get_value,
  set_value,
  get_object,
  set_object,
};
/*---------------------------------------------------------------------------*/

#if PROP_MODE_RAT_SYNC_STYLE >= PROP_MODE_RAT_SYNC_AGRESSIVE
//static
struct {
    rtimer_clock_t     op_start;
    rtimer_clock_t     op_end;
}   rat_sync = {0, ~0};

void   rat_sync_op_start(void){
    if (rat_sync.op_end != rat_sync.op_start){
        //* prev operation have finished
    rat_sync.op_start = RTIMER_NOW();
    rat_sync.op_end = rat_sync.op_start;
}
}

void   rat_sync_op_end(void){
    if (rat_sync.op_end == rat_sync.op_start){
    rat_sync.op_end = RTIMER_NOW();
}
}

bool rat_sync_validate(rtimer_clock_t stamp){
    if ( RTIMER_CLOCK_LT(stamp, rat_sync.op_start) ){
        //* looks RAT time points before rx start
        PRINTF("rat_sync_check: stamp %lu violates rx start %lu\n"
                , stamp, rat_sync.op_start);
        return false;
    }
    else {
        if (rat_sync.op_start == rat_sync.op_end){
            rtimer_clock_t now = RTIMER_NOW();
            if (RTIMER_CLOCK_LT(now, stamp)){
                //* looks RAT time points after now
                PRINTF("rat_sync_check: stamp %lu violates now %lu\n"
                        , stamp, now);
                return false;
            }
        }
        else if (RTIMER_CLOCK_LT(rat_sync.op_end, stamp)){
                //* looks RAT time points after rx end
                PRINTF("rat_sync_check: stamp %lu violates rx end %lu\n"
                    , stamp, rat_sync.op_end);
                return false;
        }
    }
    return true;
}

int32_t rat_sync_miss(void){
    rf_rat_time_t rat = rf_rat_now();
    rtimer_clock_t now = RTIMER_NOW();
    rtimer_clock_t rat_now = rf_core_convert_rat_to_rtimer(rat);
    if (rat_now != now){
        PRINTF("rat_sync_validate: RAT[%lu] unsync RT [%lu]\n"
                , rat_now, now);
    }
    return rat_now - now;
}

rtimer_clock_t rat_sync_check(rtimer_clock_t stamp){
    if (rat_sync_validate(stamp))
        return stamp;
    //* here cause RAT stamp have strange value.
    //* resync RAT, and try correct stamp
    rf_rat_debug_dump();
    if(!rf_core_is_accessible()) {
      return stamp;
    }
    int32_t rat_miss = rat_sync_miss();
    if (rat_miss == 0){
        PRINTF("rat_sync_check: sync ok, unckown stamp fail\n");
        rf_rat_debug_dump();
        return stamp;
    }
    bool was_on = rx_is_on();
    if (was_on)
    rx_off_prop();
    //int32_t last_offset = rat_offset;
    if(rf_core_restart_rat() == RF_CORE_CMD_OK) {
        rf_rat_check_overflow(true);
    }
    if (was_on)
        rx_on_prop();
    int32_t rat_remiss = rat_sync_miss();
    if (rat_remiss != 0)
        PRINTF_FAIL("rat_sync_check: failed resync from %ld -> %ld\n", rat_miss , rat_remiss);
    return stamp - rat_miss;
}

#endif

/**
 * @}
 */
